Revit 2027 API
SSEPointVisibilitySettings.GetVisibility Method
 Gets the SSE point visibility for the given category.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool GetVisibility(
	Document document,
	ElementId categoryId
)
Public Shared Function GetVisibility (
	document As Document,
	categoryId As ElementId
) As Boolean
public:
static bool GetVisibility(
	Document^ document,
	ElementId^ categoryId
)
static member GetVisibility :
        document : Document *
        categoryId : ElementId -> bool
Parameters
document Document
 The document.
categoryId ElementId
 The category id.
Return Value
Boolean
 The visibility of the given category. True means the SSE points are visible.
Exceptions
Exception | Condition
ArgumentException |  The category is not valid for SSE.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
SSEPointVisibilitySettings Class
Autodesk.Revit.DB Namespace